[
  {
    "title": "Recipe Finder App",
    "imageSrc": "projects/Recipe1.png",
    "description": "A responsive web app for searching recipes using TheMealDB API. Users can search by dish name, view detailed recipe info in a modal (opened on click for each recipe), and enjoy a polished, mobile-friendly experience. Features include Dark/Light Mode, user-friendly error handling, and a reusable SearchBar component that boosted development efficiency by 30%.",
    "skills": ["React", "TypeScript", "React Router", "JavaScript", "Hooks", "Responsive Design", "TheMealDB API", "Modals", "Reusable Components"],
    "demo": "https://github.com/NazaninHashemian/RecipeFinderApp",
    "source": "https://nazaninhashemian.github.io/RecipeFinderApp"
  },
  {
    "title": "Weather Forcast",
    "imageSrc": "projects/weatherApp.png",
    "description": "A real-time weather application that provides detailed weather information based on city search. Built with React for a dynamic and user-friendly interface and uses Axios to fetch data from the OpenWeatherMap API. The app remembers previously searched cities using local storage and displays comprehensive weather details including temperature, humidity, wind speed, and conditions. It features a 24-hour hourly forecast with scrollable cards for quick weather insights throughout the day. The app is mobile-friendly, and performance is optimized by efficient state management and minimizing redundant API calls.",
    "skills": ["React", "JavaScript", "Axios", "State Management", "Local Storage", "OpenWeatherMap API", "Responsive Design"],
    "demo": "https://github.com/NazaninHashemian/weather-app",
    "source": "https://nazaninhashemian.github.io/weather-app"
  },
  {
    "title": "Video Game Explorer",
    "imageSrc": "projects/video-game.png",
    "description": "Created a game discovery platform with filtering by genre and platform. Used Zustand for state management and optimized rendering by minimizing API calls. Featured video previews, ratings, and descriptions.",
    "skills": ["React", "TypeScript", "Axios", "Zustand", "ChakraUI", "Vercel"],
    "demo": "https://github.com/NazaninHashemian/game-hub",
    "source": "https://game-hub-ochre-two.vercel.app"
  },
  {
    "title": "BuiltReminder",
    "imageSrc": "projects/reminder.png",
    "description": "BuiltReminder is a reminder management app that integrates with the CrudCrud REST API to fetch, add, and remove reminders. Developed with TypeScript and React, this app demonstrates real-world asynchronous data handling, persistent storage with Axios, and clean component-based architecture. It features a responsive UI, a controlled form component, reusable list-rendering logic, and dynamic state updates. The app simulates real CRUD interactions, showcasing both frontend and backend development skills with a temporary backend.",
    "skills": ["React", "TypeScript", "Axios", "useState", "useEffect", "Component Design", "CSS", "REST API", "CrudCrud"],
    "demo": "https://github.com/NazaninHashemian/reminders-app",
    "source": "https://nazaninhashemian.github.io/reminders-app"
  },
  {
    "title": "Expenses Tracker",
    "imageSrc": "projects/expenses-list.png",
    "description": "Built an expense tracker with features for adding, editing, and deleting entries. Integrated Zod for robust validation and used React with Bootstrap for responsive UI and better UX.",
    "skills": ["React", "JavaScript", "Bootstrap", "Zod"],
    "demo": "https://github.com/NazaninHashemian/expense-tracker",
    "source": "https://expense-tracker-smoky-rho.vercel.app"
  },
  {
    "title": "Vidly Movie Rental App",
    "imageSrc": "projects/vidly.jpg",
    "description": "Developed a movie rental platform with filtering by genre and rating. Used React hooks for efficient state management and Bootstrap for mobile-friendly layouts.",
    "skills": ["React", "JavaScript", "Hooks", "Bootstrap"],
    "demo": "https://github.com/NazaninHashemian/vidly",
    "source": "https://nazaninhashemian.github.io/vidly"
  },
  {
    "title": "SkyHosting Website",
    "imageSrc": "projects/sky.jpg",
    "description": "Designed a mobile-first, responsive website for a hosting company using OOCSS, SCSS, and AOS animations. Translated a Photoshop design into a sleek, professional online presence.",
    "skills": ["HTML", "CSS", "SCSS", "OOCSS", "AOS Library", "Photoshop"],
    "demo": "https://github.com/NazaninHashemian/SkyHost",
    "source": "https://sky-host.netlify.app"
  },

  {
    "title": "Counter App",
    "imageSrc": "projects/Counter.png",
    "description": "Demonstrates state management and user interaction, allowing users to increment, decrement, and reset a numerical value with responsive button controls. Built with a clean and minimalistic interface, it showcases the use of React hooks like useState to manage component state efficiently. This project emphasizes foundational React concepts and can serve as a reusable component in larger applications.",
    "skills": ["React", "Javascript", "HTML", "CSS"],
    "demo": "https://github.com/NazaninHashemian/counter",
    "source": "https://nazaninhashemian.github.io/counter"
  }
]
